# Найдите сумму цифр трехзначного числа. 
# Пример:
# 123 -> 6 (1 + 2 + 3)

n = (input('Введите трёх значное число:'))

sum = int(n[0]) + int(n[1])+ int(n[2])

print('Cумма чисел трёхзначного числа равна:', sum)